In [2]:
import pandas as pd
from pydataset import data
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import os
import warnings
warnings.filterwarnings("ignore")
from env import host, user, password

## In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [5]:
data('iris').head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [6]:
iris = pd.DataFrame(data('iris'))
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

### print the first 3 rows

In [6]:
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

### print the number of rows and columns (shape)

In [7]:
iris.shape

(150, 5)

### print the column names

In [17]:
for col in iris:
    print(col)

Sepal.Length
Sepal.Width
Petal.Length
Petal.Width
Species

### OR

In [8]:
iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

### OR

In [9]:
iris.columns.to_list()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

### print the data type of each column

In [25]:
iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

### print the summary statistics for each of the numeric variables

In [10]:
iris.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

## 5. Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

In [44]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Mf8xUTYO_TDizuh1iIvheKMu8q7HPv0NNaYE17Rb9XE/edit#gid=765416759'

In [45]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
csv_export_url

'https://docs.google.com/spreadsheets/d/1Mf8xUTYO_TDizuh1iIvheKMu8q7HPv0NNaYE17Rb9XE/export?format=csv&gid=765416759'

In [47]:
df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head()

,Unnamed: 0,total_bill,tip,sex,smoker,day,time,size,tip_percentage,tip_percent,cost_per_person
0,0,16.99,1.01,Female,No,Sun,Dinner,2,0.059,5.94,8.50
1,1,10.34,1.66,Male,No,Sun,Dinner,3,0.161,16.05,3.45
2,2,21.01,3.50,Male,No,Sun,Dinner,3,0.167,16.66,7.00
3,3,23.68,3.31,Male,No,Sun,Dinner,2,0.140,13.98,11.84
4,4,24.59,3.61,Female,No,Sun,Dinner,4,0.147,14.68,6.15

### assign the first 100 rows to a new dataframe, df_google_sheets_sample

In [49]:
df_google_sheets_sample = df_googlesheet.head(100)

### print the number of rows of your original dataframe

In [52]:
df_googlesheet.shape[0]

244

### print the first 5 column names

In [74]:
df_googlesheet.head(0).iloc[:,[0,1,2,3,4]]

Empty DataFrame
Columns: [Unnamed: 0, total_bill, tip, sex, smoker]
Index: []

### print the column names that have a data type of object

In [80]:
df_googlesheet.dtypes

Unnamed: 0           int64
total_bill         float64
tip                float64
sex                 object
smoker              object
day                 object
time                object
size                 int64
tip_percentage     float64
tip_percent        float64
cost_per_person    float64
dtype: object

In [84]:
for col in df_googlesheet:
    if col = 'object'
    print(col)

SyntaxError: invalid syntax (1139182404.py, line 2)

### compute the range for each of the numeric variables.

# 6. Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

In [14]:
df_excel = pd.read_excel('Excel_Exercises.xlsx', sheet_name = 'Table1_CustDetails')

In [15]:
df_excel.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0002-ORFBO,Female,0.0,Yes,Yes,1.0,1.0,1.0,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0.0,No,No,2.0,1.0,0.0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0.0,No,No,1.0,2.0,0.0,Electronic check,73.9,280.85,Yes,3.800406

### assign the first 100 rows to a new dataframe, df_excel_sample

In [16]:
df_excel_sample = df_excel.head(100)

### print the number of rows of your original dataframe

In [18]:
df_excel.shape

(7049, 13)

### print the first 5 column names

In [19]:
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

### print the column names that have a data type of object

In [21]:
df_excel.select_dtypes(include = 'object').head(3)

  customer_id  gender partner dependents      payment_type churn
0  0002-ORFBO  Female     Yes        Yes      Mailed check    No
1  0003-MKNFE    Male      No         No      Mailed check    No
2  0004-TLHLJ    Male      No         No  Electronic check   Yes

In [23]:
df_excel.select_dtypes(include = 'object').columns.tolist()

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

### compute the range for each of the numeric variables.

In [29]:
df_excel.describe().T

,count,mean,std,min,25%,50%,75%,max
is_senior_citizen,7049.0,0.162009,0.368485,0.00,0.000000,0.000000,0.000000,1.000000
phone_service,7049.0,1.324585,0.642709,0.00,1.000000,1.000000,2.000000,2.000000
internet_service,7049.0,1.222585,0.779068,0.00,1.000000,1.000000,2.000000,2.000000
contract_type,7049.0,0.690878,0.833757,0.00,0.000000,0.000000,1.000000,2.000000
monthly_charges,7049.0,64.747014,30.099460,18.25,35.450000,70.350000,89.850000,118.750000
total_charges,7038.0,2283.043883,2266.521984,18.80,401.587500,1397.100000,3793.775000,8684.800000
tenure,7049.0,32.379866,24.595524,0.00,8.733456,28.683425,55.229399,79.341772

In [34]:
telco_stats = df_excel[['monthly_charges', 'total_charges']].describe().T
telco_stats

,count,mean,std,min,25%,50%,75%,max
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80

In [35]:
telco_stats['range'] = telco_stats['max'] - telco_stats['min']
telco_stats

,count,mean,std,min,25%,50%,75%,max,range
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75,100.5
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80,8666.0

# 7. Read the data from this google sheet into a dataframe, df_google.

In [36]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [37]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [38]:
df_google = pd.read_csv(csv_export_url)

### print the first 3 rows

In [39]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### print the number of rows and columns

In [41]:
df_google.shape

(891, 12)

### print the column names

In [45]:
df_google.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

### print the data type of each column

In [47]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### print the summary statistics for each of the numeric variables

In [48]:
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

### print the unique values for each of your categorical variables

In [49]:
for col in df_google.columns:
    if df_google[col].dtypes == 'object':
        print(f'{col} has {df_google[col].nunique()} unique values.')

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.

In [54]:
df_google.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [55]:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [56]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [57]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [3]:
import acquire
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

### Use the function defined in acquire.py to load the iris data.

In [22]:
df = acquire.get_iris_data()
df.shape

(150, 6)

In [24]:
df.columns.to_list()

['species_name', 'sepal_length', 'sepal_width', 'petal_length', 'petal_width']

### Drop the species_id and measurement_id columns.

In [23]:
cols_to_drop = ['species_id']
# measurement_id was not in there
df = df.drop(columns = cols_to_drop)
df.shape

(150, 5)

### Rename the species_name column to just species.

In [25]:
df.rename(columns = {'species_name':'species'}, inplace = True)

In [26]:
df.columns.to_list()

['species', 'sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [39]:
df.head(3)

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2

### Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [38]:
df_dummy = pd.get_dummies(df['species'], dummy_na = False)
df_dummy.head(3)

   setosa  versicolor  virginica
0       1           0          0
1       1           0          0
2       1           0          0

In [40]:
df = pd.concat([df, df_dummy], axis = 1)
df.head(3)

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0

### Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [41]:
def prep_iris(df):
    cols_to_drop = ['species_id']
    df = df.drop(columns = cols_to_drop)
    df.rename(columns = {'species_name':'species'}, inplace = True)
    df_dummy = pd.get_dummies(df['species'], dummy_na = False)
    df = pd.concat([df, df_dummy], axis = 1)
    return df

## Use the function defined in acquire.py to load the Titanic data.

In [9]:
df = acquire.get_titanic_data()
df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1

### Drop any unnecessary, unhelpful, or duplicated columns.

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.5+ KB

In [11]:
cols_to_drop = ['pclass', 'deck', 'embarked']
df = df.drop(columns = cols_to_drop)
df.columns.to_list()

['passenger_id',
 'survived',
 'sex',
 'age',
 'sibsp',
 'parch',
 'fare',
 'class',
 'embark_town',
 'alone']

### Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [12]:
dummy_df = pd.get_dummies(df[['sex', 'embark_town']], dummy_na = False, drop_first=[True, True])
dummy_df.head(3)

   sex_male  embark_town_Queenstown  embark_town_Southampton
0         1                       0                        1
1         0                       0                        0
2         0                       0                        1

In [13]:
df = pd.concat([df_titanic, dummy_df], axis = 1)
df.head(3)

,passenger_id,survived,sex,age,sibsp,parch,fare,class,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,male,22.0,1,0,7.2500,Third,Southampton,0,1,0,1
1,1,1,female,38.0,1,0,71.2833,First,Cherbourg,0,0,0,0
2,2,1,female,26.0,0,0,7.9250,Third,Southampton,1,0,0,1

### Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [14]:
def prep_titanic(df):
    df = df.drop_duplicates()
    cols_to_drop = ['pclass', 'deck', 'embarked']
    df = df.drop(columns = cols_to_drop)
    dummy_df = pd.get_dummies(df[['sex', 'embark_town']], dummy_na = False, drop_first=[True, True])
    df = pd.concat([df_titanic, dummy_df], axis = 1)
    return df

## Use the function defined in acquire.py to load the Telco data.

In [16]:
df = acquire.get_telco_data()
df.head(3)

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check

### Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   internet_service_type_id  7043 non-null   int64
 2   contract_type_id          7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  contract_type             7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [18]:
df.shape

(7043, 24)

In [19]:
df = df.drop_duplicates()
df.shape

(7043, 24)

In [21]:
cols_to_drop = ['payment_type_id', 'internet_service_type_id', 'contract_type_id']
df = df.drop(columns = cols_to_drop)
df.shape

(7043, 21)

### Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [22]:
dummy_df = pd.get_dummies(df[['contract_type', 'internet_service_type', 'payment_type']])
dummy_df.head(3)

,contract_type_Month-to-month,contract_type_One year,contract_type_Two year,internet_service_type_DSL,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Bank transfer (automatic),payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,1,0,1,0,0,0,0,0,1
1,1,0,0,1,0,0,0,0,0,1
2,1,0,0,0,1,0,0,0,1,0

In [23]:
df = pd.concat([df, dummy_df])
df.head(3)

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,contract_type_Month-to-month,contract_type_One year,contract_type_Two year,internet_service_type_DSL,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Bank transfer (automatic),payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0002-ORFBO,Female,0.0,Yes,Yes,9.0,Yes,No,No,Yes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0003-MKNFE,Male,0.0,No,No,9.0,Yes,Yes,No,No,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0004-TLHLJ,Male,0.0,No,No,4.0,Yes,No,No,No,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [24]:
def prep_telco(df):
    df = df.drop_duplicates()
    cols_to_drop = ['payment_type_id', 'internet_service_type_id', 'contract_type_id']
    df = df.drop(columns = cols_to_drop)
    dummy_df = pd.get_dummies(df[['contract_type', 'internet_service_type', 'payment_type']])
    df = pd.concat([df, dummy_df])
    return df